test/rails-dummy/app/controllers/users_controller.rb

INSERT INTO "users" ("avatar_url", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["avatar_url", "public-0fb9fb3ba7f605062e057c4397e63cf9.jpg"], ["created_at", "2015-03-06 10:44:16.079531"], ["name", "David"], ["updated_at", "2015-03-06 10:44:16.079531"]]
---
  def create
    @user = User.new(user_params)

    if @user.save